doom/.config/doom/config.org
#+TITLE: Custom Settings

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

* User Config

Set the user full name and email address to identify you
#+begin_src emacs-lisp
(setq user-full-name "Jeremy Anderson"
      user-mail-address "janderson@denim.com")
#+end_src

* Load External Plugins

#+begin_src emacs-lisp


#+end_src

* Editor Settings
** Basic Settings

*** Indentation
Indent with 2 spaces

#+begin_src emacs-lisp
;;(after! web-mode
;;  (setq web-mode-code-indent-offset 2)
;;  (setq web-mode-css-indent-offset 2)
;;  (setq web-mode-markup-indent-offset 2))

;;(after! js2-mode
;;  (setq js-indent-level 2)
;;  (setq indent-tabs-mode nil))
#+end_src

*** Look and feel
Set the default fonts for Doom

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 15)
      doom-big-font (font-spec :family "MesloLGS NF" :size 24))
#+end_src

Set the default theme for Doom

#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src

Better ANSI colors

This is to fix certain colors that wouldn't display properly in the test runner/console.
#+begin_src emacs-lisp
(custom-set-faces
  '(ansi-color-blue ((t (:foreground "RoyalBlue1" :weight bold))))
  '(ansi-color-red ((t (:foreground "firebrick" :weight bold)))))
#+end_src

Enable bold and italic for comments and keywords
#+begin_src emacs-lisp
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

Show line numbers

#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src
* ASDF config

#+begin_src emacs-lisp
;;(add-to-list 'load-path "~/.config/emacs/site-lisp/asdf")
;;(require 'asdf)

;;(asdf-enable) ;; This ensures Emacs has the correct paths to asdf shims and bin
#+end_src

#+begin_src emacs-lisp
;; (after! lsp-mode
;;   (lsp-register-client
;;    (make-lsp-client :new-connection (lsp-stdio-connection
;;                                      (lambda ()
;;                                        (list "~/.asdf/shims/elixir"
;;                                              "~/.asdf/shims/elixir-ls")))
;;                     :major-modes '(elixir-mode)
;;                     :priority -1
;;                     :server-id 'elixir-ls)))




;; In ~/.doom.d/config.el
(use-package! exec-path-from-shell
  :config
  (when (or (memq window-system '(mac ns x))
            (daemonp))
    (exec-path-from-shell-initialize)
    ;; Explicitly copy these variables
    (exec-path-from-shell-copy-envs '("PATH" "MIX_PATH" "MIX_ARCHIVES" "HEX_HOME" "MIX_HOME"))))
#+end_src

* Company Mode



Enable company mode for everything except...
#+begin_src emacs-lisp
;;(setq company-global-modes '(not inf-ruby-mode))
#+end_src

* Lisp Settings

#+begin_src emacs-lisp
;; (load (expand-file-name "~/quicklisp/slime-helper.el"))
;; Replace "sbcl" with the path to your implementation
;; (setq inferior-lisp-program "sbcl")
#+end_src

* Org config
#+begin_src emacs-lisp
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")
#+end_src

* Projectile config

#+begin_src emacs-lisp
(add-hook 'projectile-mode-hook 'projectile-direnv-export-variables)
#+end_src

#+begin_src emacs-lisp
(after! direnv
  (setq direnv-always-show-summary t)
  ;; Optional: Set the timeout for direnv operations
  (setq direnv-non-file-modes '(dired-mode magit-mode))
)
#+end_src

* Treemacs

#+begin_src emacs-lisp
(setq doom-themes-treemacs-theme "doom-colors")
#+end_src

* Elixir settings

#+begin_src emacs-lisp
;;(require 'eglot)

;; This is optional. It automatically runs `M-x eglot` for you whenever you are in `elixir-mode`:
;;(add-hook 'elixir-mode-hook 'eglot-ensure)

;; Be sure to edit the path appropriately; use the `.bat` script instead for Windows:
;;(add-to-list 'eglot-server-programs '(elixir-mode "~/.config/emacs/site-lisp/elixir-ls-v0.28.0/language_server.sh"))

(after! lsp-mode
  (setq lsp-elixir-server-command '("~/.config/emacs/site-lisp/elixir-ls-v0.28.0/language_server.sh")))

;; Increase the file watch threshold to prevent warnings in large projects
(after! lsp-mode
  (setq lsp-file-watch-threshold 5000)) ;; Adjust this number based on your needs
#+end_src

* Copilot settings

#+begin_src emacs-lisp
;; accept completion from copilot and fallback to company
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word)))

(after! copilot
  ;; Clear the warning list to suppress warnings
  (setq copilot-indent-warned-modes '())
  
  ;; Default fallback
  (setq-default copilot-indent-offset 2))

(after! copilot
  ;; Override the indentation detection function
  (defun copilot--infer-indentation-offset ()
    "Return the indentation offset for the current buffer."
    (or copilot-indent-offset
        (and (boundp 'tab-width) tab-width)
        2)))

(use-package! copilot-chat
  :defer t
  :config
  (setq copilot-chat-auth-hook #'copilot-chat-auth-from-environment)
  ;; Optionally set up keybindings
  (map! :leader
        (:prefix ("x" . "AI")
         :desc "Copilot Chat" "c" #'copilot-chat-run)))
#+end_src

* Misc config

#+begin_src emacs-lisp
;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#`+end_src

* Git config

#+begin_src emacs-lisp
;; Configure git-gutter directly
;; (use-package! git-gutter
;;   :config
;;   ;; Enable git-gutter globally
;;   (global-git-gutter-mode +1)

;;   ;; Make sure it's enabled by default in text-mode and prog-mode
;;   (add-hook! (prog-mode text-mode) #'git-gutter-mode)

;;   ;; Update git-gutter when saving and switching windows
;;   (add-hook 'after-save-hook #'git-gutter:update-all-windows)
;;   (add-hook 'focus-in-hook #'git-gutter:update-all-windows)
;;   (add-hook 'window-configuration-change-hook #'git-gutter:update-all-windows))

;; ;; Configure git-gutter-fringe with custom bitmaps
;; (use-package! git-gutter-fringe
;;   :after git-gutter
;;   :config
;;   ;; Ensure proper fringe width
;;   (fringe-mode '(8 . 8))

;;   ;; Define custom fringe bitmaps for better visibility (VSCode style)
;;   (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
;;   (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
;;   (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom)

;;   ;; Set custom colors for the fringe indicators
;;   (custom-set-faces!
;;     '(git-gutter-fr:added ((t (:foreground "green"))))
;;     '(git-gutter-fr:modified ((t (:foreground "yellow"))))
;;     '(git-gutter-fr:deleted ((t (:foreground "red"))))))

;; (add-hook! 'doom-first-input-hook
;;   (global-git-gutter-mode +1))
#+end_src
